[
    {
        "Name": "enhancer activity prediction",
        "Title": "DeepSTARR predicts enhancer activity from DNA sequence and enables the de novo design of synthetic enhancers",
        "Motivation": "Enhancers are regulatory DNA sequences that control gene expression and are crucial for animal development and physiology. Predicting enhancer activity from DNA sequences remains challenging due to the complex syntax of transcription factor (TF) motifs and their interactions. Traditional computational methods often fail to capture the intricate motif syntax and its influence on enhancer function. To address these limitations, DeepSTARR leverages deep learning to predict enhancer activity directly from DNA sequences, offering insights into motif syntax and enabling synthetic enhancer design.",
        "Method": "DeepSTARR utilizes a deep-learning approach based on convolutional neural networks (CNNs) to predict enhancer activity from DNA sequences. The model consists of four convolutional layers, each followed by a max-pooling layer, and two fully connected layers for final prediction. It takes 249-bp DNA sequences as input and outputs quantitative enhancer activity for both developmental and housekeeping transcriptional programs. The convolutional layers detect local sequence features such as TF motifs and complex patterns like motif syntax. The fully connected layers integrate these features to make precise predictions. DeepSTARR also identifies motif syntax rules, including optimal intermotif distances and favorable flanking sequences, validated experimentally through high-throughput mutagenesis.",
        "Experiment": "DeepSTARR was trained on genome-wide enhancer activity data obtained from UMI-STARR-seq, covering developmental and housekeeping enhancers in Drosophila S2 cells. The model's performance was evaluated using a held-out test set, achieving high prediction accuracy (PCC = 0.68 for developmental and PCC = 0.74 for housekeeping enhancers).",
        "Summary": "DeepSTARR accurately predicts enhancer activity directly from DNA sequences, uncovering complex motif syntax rules and enabling the rational design of synthetic enhancers. It offers a powerful tool for understanding the cis-regulatory code and advancing synthetic biology applications."
    }
]